RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pra.h
/***************************************************************************//**
* \file cy_pra.h
* \version 2.30
*
* \brief The header file of the PRA driver. The API is not intended to
* be used directly by the user application.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2022), Cypress Semiconductor Corporation
* (an Infineon company) or an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


/**
* \addtogroup group_pra
* \{
* \note The Protection Register Access (PRA) driver is intended for the PSoC 64
* devices only and provides other PDL drivers access to the registers that have
* secure access restrictions. It is not intended to be used directly by user
* application.
*
* The PRA driver is used to protect the system from invalid configurations that
* could potentially cause the system to be unstable or indirectly allow access
* to registers and memory that are protected. This is done using several
* methods:
* * Allow only valid register settings.
* * Force a specified sequence of operations when writing to a register.
* * Totally block access to registers that are deemed critical to security.
* * Allow only known, well defined system configurations.
* * Allow access to non-critical registers that are protected by a fixed PPU.
*
*   On PSoC 64 devices, secure firmware protects entire regions of registers
*   with the fixed PPUs, however there are some registers within that regions
*   that should not be protected but, are protected due to fixed PPU
*   granularity.
*
*   The list of the registers that can be accessed by PRA driver directly is
*   defined in the cy_pra.h file with the CY_PRA_INDX_ prefix.
*
* Most PDL drivers are not affected or use the PRA driver. Only the following
* PDL drivers are affected by this driver:
* * \ref group_lvd
* * \ref group_syslib
* * \ref group_sysclk
* * \ref group_syspm
* * \ref group_arm_system_timer
* * \ref group_wdt
* * \ref group_flash
* * \ref group_sysint (PSoC 64 CYB06xx7 devices only)
* * \ref group_prot (PSoC 64 CYB06xx7 devices only)
* * \ref group_gpio
*
* The execution time of the functions that access the protected registers is
* increased on the PSoC 64 devices because the access is performed on Cortex-M0+
* via the IPC command (both CPU cores run at 8 MHz):
* * The access to the protected register may take about 50 us, while access
*   to the unprotected one may take about 3 us.
* * The initial device configuration may take up to 1.75 ms for PSoC 64 devices,
*   while for the other devices it may take about 0.3 ms.
* * The transition Active to DeepSleep to Active may take about 2 times longer.
*
* \section group_pra_basic_operation Basic Operation
* The PRA driver uses an IPC channel to transfer register data between the user
* application running on the Cortex-CM4 and the secure Cortex-CM0+ CPU. The
* secure processor performs the data validation and correct register write
* sequence to ensure proper stable operation of the system. Function status and
* requested data is also returned via the IPC channel.
*
* The PDL driver that accesses protected registers, generates request to the
* PRA driver and it passes request over the IPC to secure Cortex-M0+, where
* request is validated and executed, and, then, reports result back to the
* driver on Cortex-M4 side.
*
* \image html pra_high_level_diagram.png
*
* \section group_pra_device_config Device Configuration
* For PSoC 64 device, device configuration (like system clock settings and
* power modes) is applied on the secure Cortex-M0+. The device configuration
* can be initiated from either of the core or both the cores. The device
* configuration structure \ref cy_stc_pra_system_config_t is initialized
* with Device Configurator. For Cortext-M4 application, it passed to the
* secure Cortex-M0+ core through IPC for validation and register the update
* in the cybsp_init() function. For Cortext-M0+ application, this device
* configuration structure is directly validated and applied.
*
* \note The external clocks (ECO, WCO, and EXTCLK) require
* additional configuration to be allowed to source CLK_HF0 (clocks both
* Cortex-M0+ and Cortex-M4 CPUs) in order to prevent clock tampering.
* See \ref group_pra_external_clocks for details.
*
* \note The ALTHF (BLE ECO) is not allowed to source CLK_HF0 (clocks both
* Cortex-M0+ and Cortex-M4 CPUs) in order to prevent clock tampering.
*
* \note The internal low-frequency clocks (ILO and PILO) are not allowed to
* source the CLK_HF0 directly and through PLL or FLL.
*
* \note The clock source for Cortex-M4 SysTick cannot be configured with
* the Device Configurator. Enabling CLK_ALT_SYS_TICK will result in a
* compilation error. SysTick still can be configured in run-time with
* some limitations. For more details, refer to \ref Cy_SysTick_SetClockSource()
* in \ref group_arm_system_timer.
*
* \note
* When EXT_CLK is source to HF0 then the drive mode for EXT_CLK pin is hard coded
* to CY_GPIO_DM_HIGHZ. So user has to make sure this pin configuration is not
* overwritten from secure application.
*
*\section group_pra_external_clocks External Clock Sources
* The PSoC 64 devices must be provisioned with the external clocks
* (ECO, WCO, and EXTCLK) configuration before routing these
* clocks to CLK_HF0. To do that, update the JSON
* file (delivered with CySecureTools) with the "extclk" node in the
* custom data section as shown below. The configuration fields in the
* JSON file match the fields in the Device Configurator.
*
* For more details, refer to the PSoC 64 Secure MCU Secure Boot SDK User Guide.
*
*\code{json}
*    For EXTCLK:
*        "custom_data_sections": ["extclk"],
*        "extclk": {
*                "extClkEnable": 1,
*                "extClkFreqHz": 24000000,
*                "extClkPort": 0,
*                "extClkPinNum": 0,
*                "extClkHsiom": 0
*        }
*
*    For ECO:
*        "custom_data_sections": ["extclk"],
*        "extclk": {
*                "ecoEnable": 1,
*                "ecoFreqHz": 24000000,
*                "ecoLoad": 18,
*                "ecoEsr": 50,
*                "ecoDriveLevel": 100,
*                "ecoInPort": 12,
*                "ecoOutPort": 12,
*                "ecoInPinNum": 6,
*                "ecoOutPinNum": 7,
*        }
*
*    For WCO:
*        "custom_data_sections": ["extclk"],
*        "extclk": {
*                "wcoEnable": 1,
*                "bypassEnable": 0
*                "wcoInPort": 0,
*                "wcoOutPort": 0,
*                "wcoInPinNum": 0,
*                "wcoOutPinNum": 1
*        }
*\endcode
*
*\note The same "extclk" section is used for all external clocks. If more than
* one external clock source is required, please append its parameters.
*
*\section group_pra_sram_power_config SRAM Power Mode Configurations
* The PSoC 64 devices must be provisioned with the SRAM power mode configuration
* to protects secure core memory. To do that, update the JSON
* file (delivered with CySecureTools) with the "srampwrmode" node in the
* custom data section as shown below.
*
* For more details, refer to the PSoC 64 Secure MCU Secure Boot SDK User Guide.
*
*\code{json}
*    "custom_data_sections": ["srampwrmode"],
*    "sram0": [
*        {
*            "macroNum": 1,      // bits 0
*            "powerMode": 6,     // bit 2 = ON, bit 1 = RETAIN, bit 0 = OFF
*        },
*        {
*            "macroNum": 2,      // bits 1
*            "powerMode": 1,     // bit 2 = ON, bit 1 = RETAIN, bit 0 = OFF
*        },
*        {
*            "macroNum": 65532,  // bits [15-2] = 0xFFFC
*            "powerMode": 7,     // bit 2 = ON, bit 1 = RETAIN, bit 0 = OFF
*        }
*    ],
*    "sram1": [
*        {
*            "macroNum": 1,      // bit 0
*            "powerMode": 7,     // bit 2 = ON, bit 1 = RETAIN, bit 0 = OFF
*        }
*    ],
*    "sram2": [
*        {
*            "macroNum": 1,      // bit 0
*            "powerMode": 7,     // bit 2 = ON, bit 1 = RETAIN, bit 0 = OFF
*        }
*    ]
*\endcode
*
*\note If a particular configuration(either SRAM or macro section) is
* not present in the policy file but available in the device then SRAM MACRO
* can be allowed to be modified to any of power modes (ON, RETAIN and OFF).
*
* \section group_pra_standalone Using without BSPs
* If PDL is used in Standalone mode without Board Support Package (BSP),
* do the following:
* * 1) Call the \ref Cy_PRA_Init function prior to executing
*   API of any of the drivers listed above. By default, this function is
*   called from \ref SystemInit on both CPU cores.
* * 2) Call the \ref Cy_PRA_SystemConfig function with the initial
*   device configuration passed as a parameter. Refer to Section "Function Usage"
*   of the \ref Cy_PRA_SystemConfig function for more details.
*
* \section group_pra_more_information More Information
* See the device technical reference manual (TRM) reference manual (TRM) for
* the list of the protected registers.
*
* \section group_pra_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="4">2.30</td>
*     <td>System Configuration can be done from CM0+ using PRA API with
*         CY_PRA_MSG_TYPE_SYS_CFG_FUNC and CY_PRA_FUNC_INIT_CYCFG_DEVICE arguments.</td>
*     <td>Enhancement based on customer feedback.</td>
*   </tr>
*   <tr>
*     <td>System configuration structure is updated with appropriate value, when
*         cm0+ applicaton calls any PDL API accessing to FUNCTION_POLICY registers.</td>
*     <td>Enhancement based on customer feedback.</td>
*   </tr>
*   <tr>
*     <td>Fixed MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>Updated doxygen for External clock source to HF0.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td>2.20</td>
*     <td>Allowing external clocks (EXT_CLK, ECO and WCO) can be source to secure core.
*         Provide interface for validating and configuring SRAM power modes.</td>
*     <td>External clock support and
*         SRAM power mode configuration support.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">2.10</td>
*     <td>Removed include of cy_gpio.h from the driver's c source files.
*         Added some source code comments.</td>
*     <td>Source code cleanup.</td>
*   </tr>
*   <tr>
*     <td>Updated attribute usage for the linker section placement.</td>
*     <td>Enhancement based on usability feedback.</td>
*   </tr>
*   <tr>
*     <td>Fixed MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td rowspan="6">2.0</td>
*     <td> Added PSoC 64 CYB06xx7 devices support.</td>
*     <td> New devices support.</td>
*   </tr>
*   <tr>
*     <td>
*          Updated Cy_PRA_Init() to compare the major and minor version of the PRA driver on the
*          Cortex-M0+ and Cortex-M4 sides and halt Cortex-M4 if the versions are different.
*     </td>
*     <td> Ensure that the same PRA driver version is used on the  Cortex-M0+ and Cortex-M4 sides.</td>
*   </tr>
*   <tr>
*     <td> Fixed the location of the \ref cy_stc_pra_system_config_t description in the documentation.
*     </td>
*     <td>Documentation update.</td>
*   </tr>
*   <tr>
*     <td> Corrected the reference to the \ref group_arm_system_timer function with the
*          limitation description - \ref Cy_SysTick_SetClockSource().
*     </td>
*     <td> Documentation update.</td>
*   </tr>
*   <tr>
*     <td> The state of the following clocks changes only when the requested state
*          differs from the actual state in the hardware:
*          HF1-HF5, TIMER, PUMP, BLE_ECO, ILO, PILO, and WCO.
*     </td>
*     <td> Improved the \ref Cy_PRA_SystemConfig() function execution time.</td>
*   </tr>
*   <tr>
*     <td> Renamed altHfFreq to altHFclkFreq in \ref cy_stc_pra_system_config_t.</td>
*     <td> Eliminated the naming conflict with the SysClk driver.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_pra_macros        Macros
* \defgroup group_pra_functions     Functions
* \defgroup group_pra_enums         Enumerated Types
* \defgroup group_pra_stc           Data Structures
*/

#if !defined(CY_PRA_H)
#define CY_PRA_H

