RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pra.h
#include "cy_device.h"

#if defined (CY_IP_MXS40SRSS)

#include <stdint.h>
#include <stdbool.h>
#include "cy_systick.h"
#include "cy_ble_clk.h"
#include "cy_device_headers.h"

#if defined (CY_DEVICE_SECURE) || defined (CY_DOXYGEN)

#ifdef __cplusplus
extern "C" {
#endif

/***************************************
*        Constants
***************************************/

/** \cond INTERNAL */

#if defined(CY_DEVICE_PSOC6ABLE2)
#define CY_PRA_REG_INDEX_COUNT           (157U)
#else
#define CY_PRA_REG_INDEX_COUNT           (147U)
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
#define CY_PRA_EXTCLK_PIN_NR             (5U) /* Protected pins: EXTCLK, ECO_IN, ECO_OUT, WCO_IN,  WCO_OUT */
#define CY_PRA_SRAM_MAX_NR               CPUSS_SRAM_COUNT
#define CY_PRA_SRAM_MACRO_MAX_NR         (16U)

#define CY_PRA_MSG_TYPE_REG32_GET        (1U)
#define CY_PRA_MSG_TYPE_REG32_CLR_SET    (2U)
#define CY_PRA_MSG_TYPE_REG32_SET        (3U)
#define CY_PRA_MSG_TYPE_CM0_WAKEUP       (4U)
#define CY_PRA_MSG_TYPE_SYS_CFG_FUNC     (5U)
#define CY_PRA_MSG_TYPE_SECURE_ONLY      (6U)
#define CY_PRA_MSG_TYPE_FUNC_POLICY      (7U)
#define CY_PRA_MSG_TYPE_VERSION_CHECK    (8U)
#define CY_PRA_MSG_TYPE_EXTCLK_PIN_LIST  (9U)
#define CY_PRA_MSG_TYPE_EXTCLK_ADJHSIOM_LIST    (10U)

/* IPC */
#define CY_PRA_IPC_NOTIFY_INTR          (0x1UL << CY_IPC_INTR_PRA)
#define CY_PRA_IPC_CHAN_INTR            (0x1UL << CY_IPC_CHAN_PRA)
#define CY_PRA_IPC_NONE_INTR            (0UL)

/* Registers Index */
#define CY_PRA_INDX_SRSS_PWR_LVD_CTL            (0U)
#define CY_PRA_INDX_SRSS_SRSS_INTR              (1U)
#define CY_PRA_INDX_SRSS_SRSS_INTR_SET          (2U)
#define CY_PRA_INDX_SRSS_SRSS_INTR_MASK         (3U)
#define CY_PRA_INDX_SRSS_SRSS_INTR_CFG          (4U)
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_1      (5U)
/* Do not change the index below abecause it is used in flash loaders */
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_2      (6U)
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_3      (7U)
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_4      (8U)
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_5      (9U)
#define CY_PRA_INDX_SRSS_CLK_ROOT_SELECT_6      (10U)
#define CY_PRA_INDX_FLASHC_FLASH_CMD            (11U)
#define CY_PRA_INDX_SRSS_PWR_HIBERNATE          (12U)
#define CY_PRA_INDX_SRSS_CLK_MFO_CONFIG         (13U)
#define CY_PRA_INDX_SRSS_CLK_MF_SELECT          (14U)
#define CY_PRA_INDX_FLASHC_FM_CTL_BOOKMARK      (15U)
/* There are MS_NR (16) registers. The index 16 to 31 are used. */
#define CY_PRA_INDX_PROT_MPU_MS_CTL             (16u)
/* The next index should be 32. */
/* EXT CLK port has 21 registers. The index 32 to 52 are used. */
#define CY_PRA_INDX_GPIO_EXTCLK_PRT             (32U)
/* ECO in-Port has 21 registers. The index 53 to 73 are used */
#define CY_PRA_INDX_GPIO_ECO_IN_PRT             (53U)
/* ECO out-Port has 21 registers. The index 74 to 94 are used */
#define CY_PRA_INDX_GPIO_ECO_OUT_PRT            (74U)
/* HSIOM PORT has 2 registers. The index 95 to 115 are used */
#define CY_PRA_INDX_GPIO_WCO_IN_PRT             (95U)
/* WCO out-Port has 21 registers. The index 116 to 136 are used */
#define CY_PRA_INDX_GPIO_WCO_OUT_PRT            (116U)
/* HSIOM PORT has 2 registers. The index 137 to 138 are used */
#define CY_PRA_INDEX_HSIOM_EXTCLK_PRT           (137U)
/* HSIOM PORT has 2 registers. The index 139 to 140 are used */
#define CY_PRA_INDEX_HSIOM_ECO_IN_PRT           (139U)
/* HSIOM PORT has 2 registers. The index 141 to 142 are used */
#define CY_PRA_INDEX_HSIOM_ECO_OUT_PRT          (141U)
/* HSIOM PORT has 2 registers. The index 143 to 144 are used */
#define CY_PRA_INDEX_HSIOM_WCO_IN_PRT           (143U)
/* HSIOM PORT has 2 registers. The index 145 to 146 are used */
#define CY_PRA_INDEX_HSIOM_WCO_OUT_PRT          (145U)

#if defined(CY_DEVICE_PSOC6ABLE2)
/* HSIOM PORT has 2 registers. The index 147 to 148 are used */
#define CY_PRA_INDEX_HSIOM_EXTCLK_ADJ_PRT       (147U)
/* HSIOM PORT has 2 registers. The index 149 to 150 are used */
#define CY_PRA_INDEX_HSIOM_ECO_IN_ADJ_PRT       (149U)
/* HSIOM PORT has 2 registers. The index 151 to 152 are used */
#define CY_PRA_INDEX_HSIOM_ECO_OUT_ADJ_PRT      (151U)
/* HSIOM PORT has 2 registers. The index 153 to 154 are used */
#define CY_PRA_INDEX_HSIOM_WCO_IN_ADJ_PRT       (153U)
/* HSIOM PORT has 2 registers. The index 155 to 156 are used */
#define CY_PRA_INDEX_HSIOM_WCO_OUT_ADJ_PRT      (155U)
/* The next index should be 157 */
#else
/* The next index should be 147 */
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

/* GPIO PORT REG Sub Index */
#define CY_PRA_SUB_INDEX_PORT_OUT                   (0U)
#define CY_PRA_SUB_INDEX_PORT_OUT_CLR               (1U)
#define CY_PRA_SUB_INDEX_PORT_OUT_SET               (2U)
#define CY_PRA_SUB_INDEX_PORT_OUT_INV               (3U)
#define CY_PRA_SUB_INDEX_PORT_IN                    (4U)
#define CY_PRA_SUB_INDEX_PORT_INTR                  (5U)
#define CY_PRA_SUB_INDEX_PORT_INTR_MASK             (6U)
#define CY_PRA_SUB_INDEX_PORT_INTR_MASKED           (7U)
#define CY_PRA_SUB_INDEX_PORT_INTR_SET              (8U)
#define CY_PRA_SUB_INDEX_PORT_INTR_CFG              (9U)
#define CY_PRA_SUB_INDEX_PORT_CFG                   (10U)
#define CY_PRA_SUB_INDEX_PORT_CFG_IN                (11U)
#define CY_PRA_SUB_INDEX_PORT_CFG_OUT               (12U)
#define CY_PRA_SUB_INDEX_PORT_CFG_SIO               (13U)

/* HSIOM PORT REG sub index */
#define CY_PRA_SUB_INDEX_HSIOM_PORT0                (0U)
#define CY_PRA_SUB_INDEX_HSIOM_PORT1                (1U)


/* Functions Index */
#define CY_PRA_FUNC_INIT_CYCFG_DEVICE           (0U)

#define CY_PRA_CLK_FUNC_ECO_DISABLE             (8U)
#define CY_PRA_CLK_FUNC_FLL_DISABLE             (9U)
#define CY_PRA_CLK_FUNC_PLL_DISABLE             (10U)
#define CY_PRA_CLK_FUNC_ILO_ENABLE              (11U)
#define CY_PRA_CLK_FUNC_ILO_DISABLE             (12U)
#define CY_PRA_CLK_FUNC_ILO_HIBERNATE_ON        (13U)
#define CY_PRA_CLK_FUNC_PILO_ENABLE             (14U)
#define CY_PRA_CLK_FUNC_PILO_DISABLE            (15U)
#define CY_PRA_CLK_FUNC_PILO_SET_TRIM           (16U)
#define CY_PRA_CLK_FUNC_WCO_ENABLE              (17U)
#define CY_PRA_CLK_FUNC_WCO_DISABLE             (18U)
#define CY_PRA_CLK_FUNC_WCO_BYPASS              (19U)
#define CY_PRA_CLK_FUNC_HF_ENABLE               (20U)
#define CY_PRA_CLK_FUNC_HF_DISABLE              (21U)
#define CY_PRA_CLK_FUNC_HF_SET_SOURCE           (22U)
#define CY_PRA_CLK_FUNC_HF_SET_DIVIDER          (23U)
#define CY_PRA_CLK_FUNC_FAST_SET_DIVIDER        (24U)
#define CY_PRA_CLK_FUNC_PERI_SET_DIVIDER        (25U)
#define CY_PRA_CLK_FUNC_LF_SET_SOURCE           (26U)
#define CY_PRA_CLK_FUNC_TIMER_SET_SOURCE        (27U)
#define CY_PRA_CLK_FUNC_TIMER_SET_DIVIDER       (28U)
#define CY_PRA_CLK_FUNC_TIMER_ENABLE            (29U)
#define CY_PRA_CLK_FUNC_TIMER_DISABLE           (30U)
#define CY_PRA_CLK_FUNC_PUMP_SET_SOURCE         (31U)
#define CY_PRA_CLK_FUNC_PUMP_SET_DIVIDER        (32U)
#define CY_PRA_CLK_FUNC_PUMP_ENABLE             (33U)
#define CY_PRA_CLK_FUNC_PUMP_DISABLE            (34U)
#define CY_PRA_CLK_FUNC_BAK_SET_SOURCE          (35U)
#define CY_PRA_CLK_FUNC_ECO_CONFIGURE           (36U)
#define CY_PRA_CLK_FUNC_ECO_ENABLE              (37U)
#define CY_PRA_CLK_FUNC_PATH_SET_SOURCE         (38U)
#define CY_PRA_CLK_FUNC_FLL_MANCONFIG           (39U)
#define CY_PRA_CLK_FUNC_FLL_ENABLE              (40U)
#define CY_PRA_CLK_FUNC_PLL_MANCONFIG           (41U)
#define CY_PRA_CLK_FUNC_PLL_ENABLE              (42U)
#define CY_PRA_CLK_FUNC_SLOW_SET_DIVIDER        (43U)
#define CY_PRA_CLK_FUNC_DS_BEFORE_TRANSITION    (44U)
#define CY_PRA_CLK_FUNC_DS_AFTER_TRANSITION     (45U)
#define CY_PRA_CLK_FUNC_EXT_CLK_SET_FREQUENCY   (46U)
#define CY_PRA_CLK_FUNC_ILO_TRIM                (47U)
#define CY_PRA_CLK_FUNC_SET_PILO_TRIM           (48U)
#define CY_PRA_CLK_FUNC_UPDATE_PILO_TRIM_STEP   (49U)
#define CY_PRA_CLK_FUNC_START_MEASUREMENT       (50U)
#define CY_PRA_CLK_FUNC_PILO_INITIAL_TRIM       (51U)

#define CY_PRA_PM_FUNC_HIBERNATE                (102U)
#define CY_PRA_PM_FUNC_CM4_DP_FLAG_SET          (103U)
#define CY_PRA_PM_FUNC_LDO_SET_VOLTAGE          (104U)
#define CY_PRA_PM_FUNC_BUCK_ENABLE              (105U)
#define CY_PRA_PM_FUNC_SET_MIN_CURRENT          (106U)
#define CY_PRA_PM_FUNC_SET_NORMAL_CURRENT       (107U)
#define CY_PRA_PM_FUNC_BUCK_ENABLE_VOLTAGE2     (108U)
#define CY_PRA_PM_FUNC_BUCK_DISABLE_VOLTAGE2    (109U)
#define CY_PRA_PM_FUNC_BUCK_VOLTAGE2_HW_CTRL    (110U)
#define CY_PRA_PM_FUNC_BUCK_SET_VOLTAGE2        (111U)
#define CY_PRA_PM_FUNC_SRAM_MACRO_PWR_MODE      (112U) /* Apply power mode to particular macro */
#define CY_PRA_PM_FUNC_SRAM_PWR_MODE            (113U) /* Apply power mode to entire sram */

#define CY_PRA_BLE_CLK_FUNC_ECO_CONFIGURE       (200U)
#define CY_PRA_BLE_CLK_FUNC_ECO_RESET           (201U)

#define CY_PRA_GPIO_FUNC_SECPIN                 (300U)

#define CY_PRA_PM_SRAM_PWR_MODE_OFF_Pos         (0UL)
#define CY_PRA_PM_SRAM_PWR_MODE_OFF_Msk         (0x1UL)
#define CY_PRA_PM_SRAM_PWR_MODE_RETAIN_Pos      (1UL)
#define CY_PRA_PM_SRAM_PWR_MODE_RETAIN_Msk      (0x2UL)
#define CY_PRA_PM_SRAM_PWR_MODE_ON_Pos          (2UL)
#define CY_PRA_PM_SRAM_PWR_MODE_ON_Msk          (0x4UL)

