RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pra.h
/*******************************************************************************
* Macro Name: CY_PRA_REG32_GET(regIndex)
****************************************************************************//**
*
* Reads the 32-bit value from the specified register.
*
* \note An attempt to access not-supported registers (not secure and
* not listed in the TRM) results in an error. The list of the registers that
* can be accessed by the PRA driver directly is defined in the cy_pra.h file
* with the CY_PRA_INDX_ prefix.
*
* \param regIndex The register address index.
*
* \return The read value.
*
*******************************************************************************/
    #define CY_PRA_REG32_GET(regIndex)  \
        (uint32_t) Cy_PRA_SendCmd(CY_PRA_MSG_TYPE_REG32_GET, (regIndex), 0UL, 0UL)


/*******************************************************************************
* Macro Name: CY_PRA_CM0_WAKEUP()
****************************************************************************//**
*
* The request to wake up the Cortex-M0+ core.
*
*******************************************************************************/
    #define CY_PRA_CM0_WAKEUP()  \
        (void)Cy_PRA_SendCmd(CY_PRA_MSG_TYPE_CM0_WAKEUP, (uint16_t) 0U, 0UL, 0UL)

#endif /* (CY_CPU_CORTEX_M4) */

/*******************************************************************************
* Macro Name: CY_PRA_FUNCTION_CALL_RETURN_PARAM(msgType, funcIndex, param)
****************************************************************************//**
*
* Calls the specified function with the provided parameter and returns the
* execution status.
*
* \param msgType The function type.
*
* \param funcIndex The function reference.
*
* \param param The pointer to the function parameter.
*
* \return The function execution status.
*
*******************************************************************************/
    #define CY_PRA_FUNCTION_CALL_RETURN_PARAM(msgType, funcIndex, param)  \
        Cy_PRA_SendCmd((msgType), (funcIndex), (uint32_t)(param), 0UL)


/*******************************************************************************
* Macro Name: CY_PRA_FUNCTION_CALL_RETURN_VOID(msgType, funcIndex)
****************************************************************************//**
*
* Calls the specified function without a parameter and returns the
* execution status.
*
* \param msgType The function type.
*
* \param funcIndex The function reference.
*
* \return The function execution status.
*
*******************************************************************************/
    #define CY_PRA_FUNCTION_CALL_RETURN_VOID(msgType, funcIndex)  \
        Cy_PRA_SendCmd((msgType), (funcIndex), 0UL, 0UL)


/*******************************************************************************
* Macro Name: CY_PRA_FUNCTION_CALL_VOID_PARAM(msgType, funcIndex, param)
****************************************************************************//**
*
* Calls the specified function with the provided parameter and returns void.
*
* \param msgType The function type.
*
* \param funcIndex The function reference.
*
* \param param The pointer to the function parameter.
*
*******************************************************************************/
    #define CY_PRA_FUNCTION_CALL_VOID_PARAM(msgType, funcIndex, param)  \
        (void)Cy_PRA_SendCmd((msgType), (funcIndex), (uint32_t)(param), 0UL)


/*******************************************************************************
* Macro Name: CY_PRA_FUNCTION_CALL_VOID_VOID(msgType, funcIndex)
****************************************************************************//**
*
* Calls the specified function without a parameter and returns void.
*
* \param msgType The function type.
*
* \param funcIndex The function reference.
*
*******************************************************************************/
    #define CY_PRA_FUNCTION_CALL_VOID_VOID(msgType, funcIndex)  \
        (void)Cy_PRA_SendCmd((msgType), (funcIndex), 0UL, 0UL)


#if (CY_CPU_CORTEX_M4) || defined (CY_DOXYGEN)

/*******************************************************************************
* Macro Name: CY_PRA_GET_PIN_PROT_TYPE(base, pinNum)
****************************************************************************//**
*
* Compares the PORT and PIN number with secure PIN list and returns PIN
* protection type.
*
* \param base GPIO Port address
*
* \param pinNum GPIO PIN number
*
* \return The categories of PIN.
*
*******************************************************************************/
    #define CY_PRA_GET_PIN_PROT_TYPE(base, pinNum)  \
        Cy_PRA_GetPinProtType(base, pinNum)

/*******************************************************************************
* Macro Name: CY_PRA_IS_PORT_SECURE(base)
****************************************************************************//**
*
* Compares the PORT with secure PIN list and returns PORT protection status.
*
* \param base GPIO Port address
*
* \return true if port is secure otherwise false.
*
*******************************************************************************/
    #define CY_PRA_IS_PORT_SECURE(base)  \
        Cy_PRA_IsPortSecure(base)

#if defined(CY_DEVICE_PSOC6ABLE2)
/*******************************************************************************
* Macro Name: CY_PRA_IS_HSIOM_SECURE(base)
****************************************************************************//**
*
* Compares the PORT with secure adjacent HSIOM list and returns protection status.
*
* \param base GPIO Port address
*
* \return true if HSIOM is secure otherwise false.
*
*******************************************************************************/
    #define CY_PRA_IS_HSIOM_SECURE(base)  \
        Cy_PRA_IsHsiomSecure(base)

#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

/*******************************************************************************
* Macro Name: CY_PRA_GET_PORT_INDEX(base, pinNum, subIndex)
****************************************************************************//**
*
* Compares the PORT and PIN number with secure PIN list and returns PORT index
*
* \param base GPIO Port address
*
* \param subIndex register index of GPIO PORT
*
* \return PRA GPIO PORT register index
*
*******************************************************************************/
    #define CY_PRA_GET_PORT_REG_INDEX(base, subIndex)  \
        Cy_PRA_GetPortRegIndex(base, subIndex)

