RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_pra.h
/*******************************************************************************
* Macro Name: CY_PRA_GET_HSIOM_REG_INDEX(base, subIndex)
****************************************************************************//**
*
* Compares the PORT with secure PIN list and returns HSIOM port index
*
* \param base GPIO Port address
*
* \param subIndex register index of HSIOM PORT
*
* \return PRA HSIOM PORT register index
*
*******************************************************************************/
    #define CY_PRA_GET_HSIOM_REG_INDEX(base, subIndex)  \
        Cy_PRA_GetHsiomRegIndex(base, subIndex)

#if defined(CY_DEVICE_PSOC6ABLE2)
/*******************************************************************************
* Macro Name: CY_PRA_GET_ADJHSIOM_REG_INDEX(base, subIndex)
****************************************************************************//**
*
* Compares the PORT with adjacent HSIOM list and returns HSIOM port index
*
* \param base GPIO Port address
*
* \param subIndex register index of HSIOM PORT
*
* \return PRA HSIOM PORT register index
*
*******************************************************************************/
    #define CY_PRA_GET_ADJHSIOM_REG_INDEX(base, subIndex)  \
        Cy_PRA_GetAdjHsiomRegIndex(base, subIndex)
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

/** \} group_pra_macros */

#endif /* (CY_CPU_CORTEX_M4) */

#ifdef __cplusplus
}
#endif

#endif /* (CY_DEVICE_SECURE) */

#endif /* defined (CY_IP_MXS40SRSS) */

#endif /* #if !defined(CY_PRA_H) */

/** \} group_pra */

/* [] END OF FILE */
